True if the user wishes to hide the summary section; setting this value must go through the appropriate update function
  Namespace:   Autodesk.Revit.DB.Electrical
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public bool IsSummarySectionHidden { get; }
  Visual Basic
Public ReadOnly Property IsSummarySectionHidden As Boolean
	Get
  Visual C++
public:
property bool IsSummarySectionHidden {
	bool get ();
}
 See Also
  PanelScheduleData Class
  Autodesk.Revit.DB.Electrical Namespace